## [DataFrame 인덱스 다루기]

- (1) 모듈 로딩 <hr>

In [2]:
import pandas as pd

- (2) 데이터 준비 <hr>

In [3]:
exam={ '이름':['마징가', '베트맨', '홍길동', '임꺽정'],
      '국어':[98, 79, 99, 100],
      '미술':[70, 99, 87, 80],
      '수학':[77, 70, 89, 72],
      '체육':[77, 80, 75, 100]}

- (3) 데이터 저장

In [4]:
examDF=pd.DataFrame(exam)

- (4) 데이터 확인

In [5]:
examDF

    이름   국어  미술  수학   체육
0  마징가   98  70  77   77
1  베트맨   79  99  70   80
2  홍길동   99  87  89   75
3  임꺽정  100  80  72  100

- 행 데이터 추가

In [6]:
# 마징가 98 50 60 77
examDF.loc[4] = ['마징가', 98, 50, 60, 77]

In [7]:
# 마징가 98 87 77 91
examDF.loc[5] = ['마징가', 98, 87, 70, 91]

In [8]:
examDF

    이름   국어  미술  수학   체육
0  마징가   98  70  77   77
1  베트맨   79  99  70   80
2  홍길동   99  87  89   75
3  임꺽정  100  80  72  100
4  마징가   98  50  60   77
5  마징가   98  87  70   91

- (5) 새로운 인덱스 설정 - 방법1 : 인덱스 일부 변경 DF.rename()

In [9]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
examDF.rename(index={0:'zero'})   # 원본에 영향을 안준다.

       이름   국어  미술  수학   체육
zero  마징가   98  70  77   77
1     베트맨   79  99  70   80
2     홍길동   99  87  89   75
3     임꺽정  100  80  72  100
4     마징가   98  50  60   77
5     마징가   98  87  70   91

In [10]:
examDF

    이름   국어  미술  수학   체육
0  마징가   98  70  77   77
1  베트맨   79  99  70   80
2  홍길동   99  87  89   75
3  임꺽정  100  80  72  100
4  마징가   98  50  60   77
5  마징가   98  87  70   91

In [11]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame에 변경여부 결정, 기본은 원본 변경 안함 False!!!
examDF.rename(index={0:'zero'})

       이름   국어  미술  수학   체육
zero  마징가   98  70  77   77
1     베트맨   79  99  70   80
2     홍길동   99  87  89   75
3     임꺽정  100  80  72  100
4     마징가   98  50  60   77
5     마징가   98  87  70   91

In [12]:
examDF

    이름   국어  미술  수학   체육
0  마징가   98  70  77   77
1  베트맨   79  99  70   80
2  홍길동   99  87  89   75
3  임꺽정  100  80  72  100
4  마징가   98  50  60   77
5  마징가   98  87  70   91

In [13]:
# 열 이름 인덱스 일부 변경 => column={기존인덱스:새로운인덱스}
examDF.rename(columns={'체육':'음악'})

    이름   국어  미술  수학   음악
0  마징가   98  70  77   77
1  베트맨   79  99  70   80
2  홍길동   99  87  89   75
3  임꺽정  100  80  72  100
4  마징가   98  50  60   77
5  마징가   98  87  70   91

In [14]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

- (5) 새로운 인덱스 설정 - 방법2: 특정 컬럼 => 인덱스 : DF.set_index()

In [15]:
# 현재 기본 0 ~ ==> 이름 컬럼 인덱스로 설정
examDF.index

Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [16]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라메터가 False로 원본에 적용 안됨!
examDF2 = examDF.set_index('이름')
examDF2.index

Index(['마징가', '베트맨', '홍길동', '임꺽정', '마징가', '마징가'], dtype='object', name='이름')

In [17]:
examDF2.loc['마징가']

     국어  미술  수학  체육
이름
마징가  98  70  77  77
마징가  98  50  60  77
마징가  98  87  70  91

In [18]:
# 2개의 컬럼을 행 인덱스 설정 단, inplace 파라메터가 False로 원본에 적용 안됨!
examDF3 = examDF.set_index(['이름','국어','수학'])
examDF3.index

MultiIndex([('마징가',  98, 77),
            ('베트맨',  79, 70),
            ('홍길동',  99, 89),
            ('임꺽정', 100, 72),
            ('마징가',  98, 60),
            ('마징가',  98, 70)],
           names=['이름', '국어', '수학'])

In [19]:
examDF3.loc[('마징가',98,70)]

미술    87
체육    91
Name: (마징가, 98, 70), dtype: int64

In [20]:
examDF3.loc[('마징가',98)]

C:\Users\KDP-23\AppData\Local\Temp\ipykernel_13336\3044410823.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF3.loc[('마징가',98)]

    미술  체육
수학
77  70  77
60  50  77
70  87  91

In [21]:
# keyError => '마징가', 98, 46 형식으로 98로 시작하는 key 없음
# examDF3.loc[(98,46)]

- (5) 새로운 인덱스 설정 방법 3 : 멀티인덱스 제어 DF.set_index([컬럼1, 컬럼2, ..., 컬럼n])

In [22]:
# 이름, 국어, 수학을 인덱스로 설정
examDF.set_index(['이름', '국어', '수학'])

            미술   체육
이름  국어  수학
마징가 98  77  70   77
베트맨 79  70  99   80
홍길동 99  89  87   75
임꺽정 100 72  80  100
마징가 98  60  50   77
        70  87   91

In [23]:
# 인덱스 속성 확인
examDF1 = examDF.set_index(['이름', '국어', '수학'])
examDF1

            미술   체육
이름  국어  수학
마징가 98  77  70   77
베트맨 79  70  99   80
홍길동 99  89  87   75
임꺽정 100 72  80  100
마징가 98  60  50   77
        70  87   91

In [24]:
# 인덱스 속성 확인
examDF1.index

MultiIndex([('마징가',  98, 77),
            ('베트맨',  79, 70),
            ('홍길동',  99, 89),
            ('임꺽정', 100, 72),
            ('마징가',  98, 60),
            ('마징가',  98, 70)],
           names=['이름', '국어', '수학'])

- 행 데이터 선택 : DF객체변수명.loc[행 레이블] / DF객체변수명.iloc[위치인덱스]

In [25]:
examDF1.loc[('마징가', 98, 77)]

미술    70
체육    77
Name: (마징가, 98, 77), dtype: int64

In [26]:
examDF1.loc[('마징가', 98, 70)]

미술    87
체육    91
Name: (마징가, 98, 70), dtype: int64

In [27]:
examDF1.loc[('마징가', 98, 60)]

미술    50
체육    77
Name: (마징가, 98, 60), dtype: int64

In [28]:
# KeyError 발생 ===> ('마징가', 98, 77)
#examDF1.loc[(98)]

- 멀티인덱스의 인덱스의 일부분을 기준으로 행 선택 : xs()
     * 예) '마징가' 98 77 => Level 0 1 2

In [29]:
examDF1.xs('마징가', level=0)

       미술  체육
국어 수학
98 77  70  77
   60  50  77
   70  87  91

In [30]:
examDF1.xs(98, level=1)

        미술  체육
이름  수학
마징가 77  70  77
    60  50  77
    70  87  91

In [31]:
examDF1.xs(70, level=2)

        미술  체육
이름  국어
베트맨 79  99  80
마징가 98  87  91

- ('마징가',98,77), ('임꺽정',100,72) 2개 행을 한꺼번에 가져오기

In [32]:
examDF1.loc[[('마징가', 98, 77), ('임꺽정',100,72)]]

            미술   체육
이름  국어  수학
마징가 98  77  70   77
임꺽정 100 72  80  100

In [33]:
examDF1.loc[('마징가', 98, 77)]

미술    70
체육    77
Name: (마징가, 98, 77), dtype: int64

In [34]:
examDF1.loc[[('마징가', 98, 77)]]

           미술  체육
이름  국어 수학
마징가 98 77  70  77

- (5) 인덱스 재배치 : 행/열 인덱스를 원하는 순서대로 재배치+ 존재하지 않는 행/열 추가
     * DF.reindex()

In [35]:
print(examDF.index, examDF.columns, sep='\n\n')

Index([0, 1, 2, 3, 4, 5], dtype='int64')

Index(['이름', '국어', '미술', '수학', '체육'], dtype='object')

- 컬럼명 순서 변경 ==> '체육', '미술', '국어', '수학'

In [36]:
examDF.reindex(['체육', '미술', '국어', '수학'])    # axis 기본은 행(index)

     이름  국어  미술  수학  체육
체육  NaN NaN NaN NaN NaN
미술  NaN NaN NaN NaN NaN
국어  NaN NaN NaN NaN NaN
수학  NaN NaN NaN NaN NaN

In [37]:
examDF.reindex(['체육', '미술', '국어', '수학','총합'], axis='columns')

    체육  미술   국어  수학  총합
0   77  70   98  77 NaN
1   80  99   79  70 NaN
2   75  87   99  89 NaN
3  100  80  100  72 NaN
4   77  50   98  60 NaN
5   91  87   98  70 NaN

In [38]:
examDF.reindex(['체육', '미술', '국어', '수학','총합'], axis='columns', fill_value=0)

    체육  미술   국어  수학  총합
0   77  70   98  77   0
1   80  99   79  70   0
2   75  87   99  89   0
3  100  80  100  72   0
4   77  50   98  60   0
5   91  87   98  70   0

- 행 인덱스 재배치:0,2,4,1,3,5

In [39]:
examDF.reindex([0,2,4,1,3,5], axis='index', fill_value=0)

    이름   국어  미술  수학   체육
0  마징가   98  70  77   77
2  홍길동   99  87  89   75
4  마징가   98  50  60   77
1  베트맨   79  99  70   80
3  임꺽정  100  80  72  100
5  마징가   98  87  70   91

- 컬럼명 순서 변경 ==> '체육','미술','국어','수학','총합' + 행인덱스 => 0,2,4,1,3,5 재배치

In [40]:
examDF.reindex(index=[0,2,4,1,3,5], columns=['체육', '미술', '국어', '수학','총합'], fill_value=0)

    체육  미술   국어  수학  총합
0   77  70   98  77   0
2   75  87   99  89   0
4   77  50   98  60   0
1   80  99   79  70   0
3  100  80  100  72   0
5   91  87   98  70   0